## 결측치가 제일 큰 값의 컬럼명을 구하시오

* data: t1-data1.csv

In [1]:
import pandas as pd
df = pd.read_csv('../../dataset/t1-data1.csv')
df.head()

     id   age city    f1  f2    f4         f5
0  id01   2.0   서울   NaN   0  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  INFP  52.667078
4  id05  24.0   서울  85.0   2  ISFJ  29.269869

## User Code

## My code

In [2]:
df.isna().sum()

id       0
age      0
city     0
f1      29
f2       0
f4       0
f5       0
dtype: int64

In [3]:
print('f1')

f1

## Solution

In [4]:
df = pd.DataFrame(df.isna().sum(), columns=['cnt_null'])
df.head()

      cnt_null
id           0
age          0
city         0
f1          29
f2           0

In [5]:
df = pd.read_csv('../dataset/t1-data1.csv')
df = df['cnt_null'].sort_values(ascending=False)
print(df.index[0])

f1

In [6]:
# 풀이2
df = pd.read_csv('../dataset/t1-data1.csv')
df = df.isnull().sum()
print(df.index[3])

f1